/*
 * 
 * 支付子目的定义
 * 此处约定子目的为父定义*10开始
 * 如 父定义 账户充值 为 1  则此处 账户充值子类型 从 10 开始  19 结束
 */
namespace OneCoin.Service.Model.Enum.Payment
{
    public enum PaymentSubPurpose
    {
        支付停车费 = 1,

        闲时超时费 = 2,

        忙时超时费 = 3,

        账户充值=10,

        支付月租 = 20,

        //归到支付停车费 自动缴费 = 40,

        购买时段月租=50,

        时段月租续费 = 51,

        预约车位=60,


        上门洗车=71,

        到店洗车=72,

        房车露营地 = 73,

        U型枕 = 74,

        车载套装=75,

        武隆景区套票 = 1006,

        武隆景区宝贝护照 = 1007,

        亚特兰蒂斯 = 1008,

        万圣节 = 1009,
    }
}
